# ParameterValuePresenceRule Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterValuePresenceRule Class
Members See Also
---
Tests whether an element's parameter has a value or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public class ParameterValuePresenceRule : FilterRule
```

Visual Basic
---
```text
Public Class ParameterValuePresenceRule _
	Inherits FilterRule
```

Visual C++
---
```text
public ref class ParameterValuePresenceRule : public FilterRule
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterRule Autodesk.Revit.DB..::..ParameterValuePresenceRule Autodesk.Revit.DB..::..HasNoValueFilterRule Autodesk.Revit.DB..::..HasValueFilterRule
# See Also
ParameterValuePresenceRule Members
Autodesk.Revit.DB Namespace